Design Patterns/MermaidJS/Structural Pattern/adapter(object).mmd
---
title: Object Adapter
config:
    class:
        hideEmptyMembersBox: true
---
classDiagram
    namespace Target {
        %% Target
        class IBubblegum {
            <<interface>>
            +chew()
        }
    }
    namespace Adaptee {
        %% Adaptee
        class IShip {
            <<interface>>
            +cruise()
        }
    }
    namespace Adapter {
        %% Adapter
        class BubblegumShipAdapter {
            #ship: IShip
            +chew()
        }
    }

    IBubblegum <|.. BubblegumShipAdapter
    %% Client
    Client --> IBubblegum : uses
    %% Miscs
    BubblegumShipAdapter o--> IShip : has a

    %% Notes
    note for BubblegumShipAdapter "chew(): ship->cruise()"
    note "Goal: Allows incompatible interfaces to work together."
    note "Object Adapter uses aggregation to make interfaces compatible"
    note "Target: The interface the Client uses"
    note "Adaptee: The class with useful functionality, but an incompatible interface"
    note "Adapter: Lets you use an Adaptee as if it were a Target"
